""" Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

Пример:

- [2, 3, 4, 5, 6] => [12, 15, 16];
- [2, 3, 5, 6] => [12, 15] """
nums = [2, 3, 4, 5, 6]

new_len = len(nums) // 2 + len(nums) % 2
new_nums = []

for i in range(new_len):
    n = nums[i] * nums[len(nums) - 1 - i]
    new_nums.append(n)
print(new_nums)
